
#Область Переменные



// кеш объекта Рефлектор
// кешируем т.к. используется часто - при инициализации
// и при каждом запуске пользовательской функции
Перем _Рефлектор;

// объект, в котором расположена запускаемая функция
Перем _ОбъектСценария;
// имя запускаемой функции
Перем _ФункцияСценария;

// тип запускаемой функции
//
// Строка, возможные значения:
// - http
// - cloudevent
Перем _FunctionSignatureType;



#КонецОбласти



#Область ОбработчикиЗапросов



Процедура ОбработчикЗапросовHttp( Знач HTTPКонтекст, Знач СледующийОбработчик ) Экспорт
	
    // запрос к robots.txt должен отдавать 404 согласно контракту
	Если "/robots.txt" = HTTPКонтекст.Запрос.Путь Тогда
		HTTPКонтекст.Ответ.КодСостояния = 404;
		Возврат;
	КонецЕсли;

	// запрос к favicon.ico должен отдавать 404 согласно контракту
	Если "/favicon.ico" = HTTPКонтекст.Запрос.Путь Тогда
		HTTPКонтекст.Ответ.КодСостояния = 404;
		Возврат;
	КонецЕсли;
	
	// вызываем пользовательскую функцию
	Параметры = Новый Массив;
	Параметры.Добавить( HTTPКонтекст.Запрос );
	Параметры.Добавить( HTTPКонтекст.Ответ );
	Попытка
		_Рефлектор.ВызватьМетод( _ОбъектСценария, _ФункцияСценария, Параметры );
	Исключение
		// TODO переписать на свой класс ответа и заполнять ответ из него
		HTTPКонтекст.Ответ.КодСостояния = 500;
	КонецПопытки;

КонецПроцедуры



Процедура ОбработчикЗапросовCloudEvent( Знач HTTPКонтекст, Знач СледующийОбработчик ) Экспорт
    
    // robots.txt / favicon.ico
    Если "/robots.txt" = HTTPКонтекст.Запрос.Путь Тогда
        HTTPКонтекст.Ответ.КодСостояния = 404;
        Возврат;
    КонецЕсли;
    Если "/favicon.ico" = HTTPКонтекст.Запрос.Путь Тогда
        HTTPКонтекст.Ответ.КодСостояния = 404;
        Возврат;
    КонецЕсли;
    
    // Парсинг CloudEvent
    Попытка
        Событие = ПарситьCloudEvent( HTTPКонтекст.Запрос );
    Исключение
        HTTPКонтекст.Ответ.КодСостояния = 400;
        LogError( "ru = ""Ошибка парсинга CloudEvent: %1""", ОписаниеОшибки() );
        Возврат;
    КонецПопытки;

    // Вызов пользовательской функции
    Параметры = Новый Массив;
    Параметры.Добавить( Событие );
    Попытка
        _Рефлектор.ВызватьМетод( _ОбъектСценария, _ФункцияСценария, Параметры );
    Исключение
        HTTPКонтекст.Ответ.КодСостояния = 500;
        LogError( "ru = ""Ошибка в CloudEvent-функции: %1""", ОписаниеОшибки() );
        Возврат;
    КонецПопытки;

    // Успех (без тела)
    HTTPКонтекст.Ответ.КодСостояния = 204;

КонецПроцедуры



#КонецОбласти



#Область Вспомогательные


Процедура die( Знач ТекстСообщения, Знач Вставка1 = Неопределено )

	LogError( ТекстСообщения, Вставка1 );
	ЗавершитьРаботу( 1 );

КонецПроцедуры



Функция ФайлСуществует( Путь )

	Файл = Новый Файл( Путь );
	Возврат Файл.Существует();

КонецФункции


Функция ЕстьАннотация( Знач ОписаниеМетода, Знач Аннотация )

	Для Каждого ОписаниеАннотации Из ОписаниеМетода.Аннотации Цикл
		Если СтрокиРавны( ОписаниеАннотации.Имя, Аннотация ) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции



Функция ЕстьАннотацияHttp( Знач ОписаниеМетода )
	
	Возврат ЕстьАннотация( ОписаниеМетода, АннотацияHttp() );

КонецФункции



Функция ЕстьАннотацияCloudEvent( Знач ОписаниеМетода )

    Возврат ЕстьАннотация( ОписаниеМетода, АннотацияCloudEvent() );

КонецФункции 



Функция СтрокиРавны( Строка1, Строка2 )
	Возврат 0 = СтрСравнить( Строка1, Строка2 );
КонецФункции



Функция МетодСуществует( Знач ТаблицаМетодов, ИмяМетода )

	Для Каждого ОписаниеМетода Из ТаблицаМетодов Цикл
		Если СтрокиРавны( ОписаниеМетода.Имя, ИмяМетода ) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции



Процедура LogError( Знач ТекстСообщения, Знач Вставка1 = Неопределено )

	Локализованное = НСтр( ТекстСообщения );
	Готовое = СтрШаблон( Локализованное, Вставка1 );
	Сообщить( 
		Готовое, 
		СтатусСообщения.ОченьВажное 
	);

КонецПроцедуры



Функция ЭтоКорректноеИмяМетода( ИмяМетода ) 

	// 1. Проверка на пустую строку
    Если ПустаяСтрока( ИмяМетода ) Тогда
        Возврат Ложь;
    КонецЕсли;

	// 2. Проверка на зарезервированные ключевые слова
	КлючевыеСлова = Новый Массив;
	// Русские операторы и конструкции
    КлючевыеСлова.Добавить( "если" );
    КлючевыеСлова.Добавить( "иначеесли" );
    КлючевыеСлова.Добавить( "иначе" );
    КлючевыеСлова.Добавить( "концесли" );
    КлючевыеСлова.Добавить( "для" );
    КлючевыеСлова.Добавить( "по" );
    КлючевыеСлова.Добавить( "цикл" );
    КлючевыеСлова.Добавить( "конеццикла" );
    КлючевыеСлова.Добавить( "пока" );
    КлючевыеСлова.Добавить( "продолжить" );
    КлючевыеСлова.Добавить( "прервать" );
    КлючевыеСлова.Добавить( "перейти" );
    КлючевыеСлова.Добавить( "процедура" );
    КлючевыеСлова.Добавить( "функция" );
    КлючевыеСлова.Добавить( "конецпроцедуры" );
    КлючевыеСлова.Добавить( "конецфункции" );
    КлючевыеСлова.Добавить( "перем" );
    КлючевыеСлова.Добавить( "возврат" );
    КлючевыеСлова.Добавить( "попытка" );
    КлючевыеСлова.Добавить( "исключение" );
    КлючевыеСлова.Добавить( "вызватьисключение" );
    КлючевыеСлова.Добавить( "конецпопытки" );
    КлючевыеСлова.Добавить( "новый" );
    КлючевыеСлова.Добавить( "выполнить" );
    КлючевыеСлова.Добавить( "ждать" );
    КлючевыеСлова.Добавить( "добавитьобработчик" );
    КлючевыеСлова.Добавить( "удалитьобработчик" );
    КлючевыеСлова.Добавить( "и" );
    КлючевыеСлова.Добавить( "или" );
    КлючевыеСлова.Добавить( "не" );
    КлючевыеСлова.Добавить( "асинх" );
    КлючевыеСлова.Добавить( "экспорт" );
    КлючевыеСлова.Добавить( "знач" );
    КлючевыеСлова.Добавить( "из" );
    КлючевыеСлова.Добавить( "истина" );
    КлючевыеСлова.Добавить( "ложь" );
    КлючевыеСлова.Добавить( "неопределено" );
    КлючевыеСлова.Добавить( "null" );  
    // Английские операторы и конструкции
    КлючевыеСлова.Добавить( "if" );
    КлючевыеСлова.Добавить( "elsif" );
    КлючевыеСлова.Добавить( "else" );
    КлючевыеСлова.Добавить( "endif" );
    КлючевыеСлова.Добавить( "for" );
    КлючевыеСлова.Добавить( "to" );
    КлючевыеСлова.Добавить( "do" );
    КлючевыеСлова.Добавить( "endo" );
    КлючевыеСлова.Добавить( "while" );
    КлючевыеСлова.Добавить( "continue" );
    КлючевыеСлова.Добавить( "break" );
    КлючевыеСлова.Добавить( "goto" );
    КлючевыеСлова.Добавить( "procedure" );
    КлючевыеСлова.Добавить( "function" );
    КлючевыеСлова.Добавить( "endprocedure" );
    КлючевыеСлова.Добавить( "endfunction" );
    КлючевыеСлова.Добавить( "var" );
    КлючевыеСлова.Добавить( "return" );
    КлючевыеСлова.Добавить( "try" );
    КлючевыеСлова.Добавить( "except" );
    КлючевыеСлова.Добавить( "raise" );
    КлючевыеСлова.Добавить( "endtry" );
    КлючевыеСлова.Добавить( "new" );
    КлючевыеСлова.Добавить( "execute" );
    КлючевыеСлова.Добавить( "await" );
    КлючевыеСлова.Добавить( "addhandler" );
    КлючевыеСлова.Добавить( "removehandler" );
    КлючевыеСлова.Добавить( "and" );
    КлючевыеСлова.Добавить( "or" );
    КлючевыеСлова.Добавить( "not" );
    КлючевыеСлова.Добавить( "async" );
    КлючевыеСлова.Добавить( "export" );
    КлючевыеСлова.Добавить( "val" );
    КлючевыеСлова.Добавить( "in" );
    КлючевыеСлова.Добавить( "each" );
    КлючевыеСлова.Добавить( "true" );
    КлючевыеСлова.Добавить( "false" );
    КлючевыеСлова.Добавить( "undefined" );
    
    Если КлючевыеСлова.Найти( НРег(ИмяМетода) ) <> Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    РегВыр = Новый РегулярноеВыражение( "^[a-zA-Zа-яА-ЯёЁ_][a-zA-Zа-яА-ЯёЁ0-9_]*$" );
    РегВыр.ИгнорироватьРегистр = Истина;
    
    Возврат РегВыр.Совпадает( ИмяМетода );

КонецФункции


Функция ПарситьCloudEvent( Знач Запрос )

	Заголовки = Запрос.Заголовки;
    
    // Structured mode
	ВсеЗаголовки = Заголовки.Получить( "Content-Type" );
    Если ЗначениеЗаполнено( ВсеЗаголовки ) И СтрокиРавны( ВсеЗаголовки[0], "application/cloudevents+json" ) Тогда

		ЧтениеДанных = Новый ЧтениеДанных(Запрос.Тело);
		ТелоСтрока = ПолучитьСтрокуИзДвоичныхДанных( ЧтениеДанных.Прочитать().ПолучитьДвоичныеДанные() );
		ЧтениеДанных.Закрыть();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку( ТелоСтрока );
		Событие = ПрочитатьJSON( ЧтениеJSON, Истина );
        ЧтениеJSON.Закрыть();
        Возврат Событие;

    КонецЕсли;

    // Binary mode - проверяем наличие заголовков Ce-
    ЕстьЗаголовокCloudEvent = Ложь;
    Для Каждого КлЗн Из Заголовки Цикл
        Если СтрНачинаетсяС( КлЗн.Ключ, "Ce-" ) Тогда
            ЕстьЗаголовокCloudEvent = Истина;
            Прервать;
        КонецЕсли;
    КонецЦикла;

    Если ЕстьЗаголовокCloudEvent Тогда
        Событие = Новый Соответствие;
        Для Каждого КлЗн Из Заголовки Цикл
            Если СтрНачинаетсяС( КлЗн.Ключ, "Ce-" ) Тогда
                ИмяАтрибута = НРег( Сред( КлЗн.Ключ, 4 ) );
                Событие.Вставить( ИмяАтрибута, Заголовки[КлЗн.Ключ][0] );
            КонецЕсли;
        КонецЦикла;
		// нормализация объекта CLoudEvent
		// CloudEventSDK требует если datacontenttype не был указан в запросе
		// его значение должно считаться равным "application/json"
		Если Событие.Получить( "datacontenttype" ) = Неопределено Тогда
			Событие.Вставить( "datacontenttype" , "application/json" );
		КонецЕсли;
		// парсинг тела запроса в атрибут data
		ЧтениеДанных = Новый ЧтениеДанных(Запрос.Тело);
		ТелоСтрока = ПолучитьСтрокуИзДвоичныхДанных( ЧтениеДанных.Прочитать().ПолучитьДвоичныеДанные() );
		ЧтениеДанных.Закрыть();
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку( ТелоСтрока );
		ТелоОбъект = ПрочитатьJSON( ЧтениеJSON, Истина );
        ЧтениеJSON.Закрыть();
        Событие.Вставить( "data", ТелоОбъект );
        Возврат Событие;
    КонецЕсли;

    ВызватьИсключение "Не удалось определить формат CloudEvent";

КонецФункции

#КонецОбласти



#Область ЧтениеКонфигурации



Функция КонфигурацияFunctionTarget()

	Конвейер = Новый Массив;
	Конвейер.Добавить( "FunctionTargetИзКоманднойСтроки()" );
	Конвейер.Добавить( "FunctionTargetИзПеременнойОкружения()" );

	Для Каждого Задача Из Конвейер Цикл
		Значение = Вычислить( Задача );
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции



Функция FunctionTargetИзКоманднойСтроки()

	Позиция = АргументыКоманднойСтроки.Найти( "--target" );

	// аргумента нет, прерываемся
	Если Позиция = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// если ключ командной строки указан последним - значения нет
	// это ошибка конфигурации, нужно сообщить и прервать работу
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		die( "Не указано значение параметра командной строки --target" );
	КонецЕсли;

	// берем следующий за искомым параметр командной строки
	Значение = АргументыКоманднойСтроки[ Позиция + 1 ];

	Если ПустаяСтрока( Значение ) Тогда
		die( "Значение параметра командной строки --target пустое" )
	КонецЕсли;

	Возврат Значение;

КонецФункции



Функция FunctionTargetИзПеременнойОкружения()

	Значение = ПеременныеСреды().Получить( "FUNCTION_TARGET" );
	
	Если Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции



Функция КонфигурацияFunctionSource()

    Конвейер = Новый Массив;
    Конвейер.Добавить( "FunctionSourceИзКоманднойСтроки()" );
    Конвейер.Добавить( "FunctionSourceИзПеременнойОкружения()" );

	Значение = Неопределено;
    Для Каждого Задача Из Конвейер Цикл
        Значение = Вычислить( Задача );
        Если Значение <> Неопределено Тогда
            Прервать;
        КонецЕсли;
    КонецЦикла;

	Если Значение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Значение;

КонецФункции



Функция FunctionSourceИзКоманднойСтроки()

    Позиция = АргументыКоманднойСтроки.Найти( "--source" );

    Если Позиция = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
        die( "Не указано значение параметра командной строки --source" );
    КонецЕсли;

    Значение = АргументыКоманднойСтроки[ Позиция + 1 ];

    Если ПустаяСтрока( Значение ) Тогда
        die( "Значение параметра командной строки --source пустое" );
    КонецЕсли;

    Возврат Значение;

КонецФункции



Функция FunctionSourceИзПеременнойОкружения()

    Значение = ПеременныеСреды().Получить( "FUNCTION_SOURCE" );
    
    Если Значение <> Неопределено Тогда
        Возврат Значение;
    КонецЕсли;

    Возврат Неопределено;

КонецФункции



Функция КонфигурацияFunctionSignatureType()

    Конвейер = Новый Массив;
    Конвейер.Добавить( "FunctionSignatureTypeИзКоманднойСтроки()" );
    Конвейер.Добавить( "FunctionSignatureTypeИзПеременнойОкружения()" );

    Для Каждого Задача Из Конвейер Цикл
        Значение = Вычислить( Задача );
        Если Значение <> Неопределено Тогда
            Возврат Значение;
        КонецЕсли;
    КонецЦикла;

    Возврат Неопределено;

КонецФункции



Функция FunctionSignatureTypeИзКоманднойСтроки()

    Позиция = АргументыКоманднойСтроки.Найти( "--signature-type" );

    Если Позиция = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
        die( "Не указано значение параметра командной строки --signature-type" );
    КонецЕсли;

    Значение = АргументыКоманднойСтроки[ Позиция + 1 ];

    Если ПустаяСтрока( Значение ) Тогда
        die( "Значение параметра командной строки --signature-type пустое" );
    КонецЕсли;

    Возврат Значение;

КонецФункции



Функция FunctionSignatureTypeИзПеременнойОкружения()

    Значение = ПеременныеСреды().Получить( "FUNCTION_SIGNATURE_TYPE" );
    
    Если Значение <> Неопределено Тогда
        Возврат Значение;
    КонецЕсли;

    Возврат Неопределено;

КонецФункции



#КонецОбласти



#Область Константы



Функция АннотацияHttp()
	Возврат "HttpFunction";
КонецФункции



Функция АннотацияCloudEvent()
	Возврат "CloudEventFunction";
КонецФункции



Функция SignatureTypeHttp()
	Возврат "http";
КонецФункции



Функция SignatureTypeCloudEvent()
	Возврат "cloudevent";
КонецФункции



Функция ПортСервераПоУмолчанию()	
	Возврат 8080;
КонецФункции



Функция FunctionSourceПоУмолчанию()
	Возврат "main.os";
КонецФункции



Функция SignatureTypeПоУмолчанию()
    Возврат SignatureTypeHttp();
КонецФункции



#КонецОбласти



Функция ОпределитьФайлСценария()

	Конвейер = Новый Массив;
	Конвейер.Добавить( "КонфигурацияFunctionSource()" );
	Конвейер.Добавить( "FunctionSourceПоУмолчанию()" );

	Файл = Неопределено;
	Для Каждого Задача Из Конвейер Цикл
		Файл = Вычислить( Задача );
		Если Файл <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Файл = Неопределено Тогда
		Текст = 
		"ru = ""Не удалось определить имя файла, содержащего функцию для выполнения"";
		| en = ""Unable to figure out filename containing function to execute""";
		die( Текст, Файл );
	КонецЕсли;

	Если Не ФайлСуществует( Файл ) Тогда
		Текст = 
		"ru = ""Файл с функцией не найден: %1"";
		| en = ""File not found: %1""";
		die( Текст, Файл );
	КонецЕсли;

	Возврат Файл;
	
КонецФункции



Процедура ЗагрузитьФайлСценария( Знач ИмяСценария )

	// загружаем файл с функцией
	Попытка
		_ОбъектСценария = ЗагрузитьСценарий( ИмяСценария );
	Исключение
		die( 
			"ru = ""Ошибка при загрузке файла сценария: %1"" ; en = ""Error on loading scenario file: %1""", 
			ОписаниеОшибки()
		);
	КонецПопытки;

КонецПроцедуры



Функция ОпределитьВыполняемуюФункциюПоАннотации( Знач МетодыСценария )
	
	// высший приоритет имеют функции, помеченные специальной аннотацией
	АннотированныеМетоды = Новый Массив;
	Для Каждого ОписаниеМетода Из МетодыСценария Цикл
		Если ЕстьАннотацияHttp( ОписаниеМетода ) Тогда
			АннотированныеМетоды.Добавить( ОписаниеМетода );
		КонецЕсли;
		Если ЕстьАннотацияCloudEvent( ОписаниеМетода ) Тогда
			АннотированныеМетоды.Добавить( ОписаниеМетода );
		КонецЕсли;
	КонецЦикла;

	// функций с аннотацией не найдено, прервемся
	Если АннотированныеМетоды.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// нашлось несколько аннотированных функций, 
	// не можем определить какую из них выполнять
	// это ошибка конфигурации, завершим работу приложения
	Если АннотированныеМетоды.Количество() > 1 Тогда
		Текст = 
		"ru = ""Найдено несколько функций для запуска, не понятно какую запускать"" ; 
		|en = ""Several functions was found, should be just one""";
		die( Текст );
	КонецЕсли;

	// дальше аннотированная функция ровно одна

	// проверим что функция не имеет сразу несколько разных аннотаций
	// это ошибка конфигурации, прервем работы скрипта
	Если ЕстьАннотацияHttp( АннотированныеМетоды[0] ) И ЕстьАннотацияCloudEvent( АннотированныеМетоды[0] ) Тогда
		die("ru = ""Функция имеет несколько разных аннотаций, так нельзя""");
	КонецЕсли;

	// по аннотации можно сразу определить тип выполняемой функции
	Если ЕстьАннотацияHttp( АннотированныеМетоды[0] ) Тогда
		_FunctionSignatureType = SignatureTypeHttp();
	КонецЕсли;
	Если ЕстьАннотацияCloudEvent( АннотированныеМетоды[0] ) Тогда
		_FunctionSignatureType = SignatureTypeCloudEvent();
	КонецЕсли;

	_ФункцияСценария = АннотированныеМетоды[0].Имя;
	Возврат Истина;

КонецФункции



Функция ОпределитьВыполняемуюФункциюПоКонфигурации( Знач МетодыСценария )

	
	конфиг = КонфигурацияFunctionTarget();

	Если конфиг = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	конфиг = СокрЛП( конфиг );

	Если Не ЗначениеЗаполнено( конфиг ) Тогда
		die("Указано пустое имя функции в конфигурации");
	КонецЕсли;
	
	// проверим что переданноя в конфигурации имя корректно
	Если НЕ ЭтоКорректноеИмяМетода( конфиг ) Тогда
		die( "Указанное в конфигурации имя функции не является корректным идентификатором функции" );
	КонецЕсли;

	// проверим что указанный в конфигурации метод существует у сценария
	// если метода нет - это ошибка конфигурации, завершим работу
	Если Не МетодСуществует( МетодыСценария, конфиг ) Тогда
		// TODO лучше текст и англ язык
		die("Не найдена указанная в конфигурации функция %1", конфиг );
	КонецЕсли;

	_ФункцияСценария = конфиг;
	Возврат Истина;

КонецФункции



Функция ОпределитьВыполняемуюФункциюПоУмолчанию( Знач МетодыСценария )
	
	ИмяФункцииПоУмолчанию = "main";
	Если Не МетодСуществует( МетодыСценария, ИмяФункцииПоУмолчанию ) Тогда
		Возврат Ложь;
	КонецЕсли;

	_ФункцияСценария = ИмяФункцииПоУмолчанию;
	Возврат Истина;

КонецФункции



Процедура ОпределитьВыполняемуюФункцию()

	// искать будем только среди экспортных методов
	ЭкспортныеМетодыСценария = 
		_Рефлектор.ПолучитьТаблицуМетодов( _ОбъектСценария )
		.НайтиСтроки( Новый Структура( "Экспорт", Истина ) );

	Конвейер = Новый Массив;
	// 1. ПОИСК СРЕДИ АННОТИРОВАННЫХ ФУНКЦИЙ
	Конвейер.Добавить( "ОпределитьВыполняемуюФункциюПоАннотации( ЭкспортныеМетодыСценария )" );
	// 2. ПОИСК ФУНКЦИЙ, УКАЗАННЫХ В КОНФИГУРАЦИИ
	Конвейер.Добавить( "ОпределитьВыполняемуюФункциюПоКонфигурации( ЭкспортныеМетодыСценария )" );
	// 3. ПОИСК ФУНКЦИИ ПО-УМОЛЧАНИЮ 
	Конвейер.Добавить( "ОпределитьВыполняемуюФункциюПоУмолчанию( ЭкспортныеМетодыСценария )" );

	ПараметрыЗадачи = Новый Массив;
	ПараметрыЗадачи.Добавить( ЭкспортныеМетодыСценария );
	Для Каждого Задача Из Конвейер Цикл
		Успешно = Вычислить( Задача );
		Если ТипЗнч( Успешно ) = Тип( "Булево" ) И Успешно Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

	// если дошли сюда - функцию определить не удалось
	die( "Не удалось определить имя функции для запуска" );

КонецПроцедуры



Функция ОпределитьПортСервера()

	Конвейер = Новый Массив;
	Конвейер.Добавить( "ПортСервераПоКонфигурации()" );
	Конвейер.Добавить( "ПортСервераПоУмолчанию()" );

	Для Каждого Задача Из Конвейер Цикл
		Порт = Вычислить( Задача );
		Если Порт <> Неопределено Тогда
			Возврат Порт;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции



Функция ПортСервераПоКонфигурации()

	Конвейер = Новый Массив;
	Конвейер.Добавить( "ПортСервераИзКоманднойСтроки()" );
	Конвейер.Добавить( "ПортСервераИзПеременнойОкружения()" );

	Порт = Неопределено;
	Для Каждого Задача Из Конвейер Цикл
		Порт = Вычислить( Задача );
		Если Порт <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Порт = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	// валидация значения

	Порт = СокрЛП( Порт );

    РегВыр = Новый РегулярноеВыражение( "^[0-9]+$" );
    Если Не РегВыр.Совпадает( Порт ) Тогда
		die("Указанное значение %1 не является корректным номером порта", Порт );
	КонецЕсли;

	// преобразуем в число
	Попытка
		Порт = Число( Порт );
	Исключение
		die( "НЕ удалось преобразовать значение порта %1 в число", Порт );
	КонецПопытки;

	// проверим на корректность диапазона портов
	Если Порт < 0 Или Порт > 65535 Тогда
		die( "Значение %1 не является корректным значением сетевого порта", Порт );
	КонецЕсли;

	Возврат Порт;
	
КонецФункции



Функция ПортСервераИзКоманднойСтроки()

	Позиция = АргументыКоманднойСтроки.Найти( "--port" );

	// аргумента нет, прерываемся
	Если Позиция = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// если ключ командной строки указан последним - значения нет
	// это ошибка конфигурации, нужно сообщить и прервать работу
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		die( "Не указано значение параметра командной строки --port" );
	КонецЕсли;

	// берем следующий за искомым параметр командной строки
	Значение = АргументыКоманднойСтроки[ Позиция + 1 ];

	Если ПустаяСтрока( Значение ) Тогда
		die( "Значение параметра командной строки --port пустое" );
	КонецЕсли;

	Возврат Значение;

КонецФункции



Функция ПортСервераИзПеременнойОкружения()

	Значение = ПеременныеСреды().Получить( "PORT" );
	
	Если Значение <> Неопределено Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции



Процедура ОпределитьFunctionSignatureType()

	// тип функции мог быть определен ранее аннотацией
	// в этом случае  дальнейшие шаги делать не нужно
	Если _FunctionSignatureType <> Неопределено Тогда
		Возврат;
	КонецЕсли;

    Конвейер = Новый Массив;
    Конвейер.Добавить( "КонфигурацияFunctionSignatureType()" );
    Конвейер.Добавить( "SignatureTypeПоУмолчанию()" );

	Значение = Неопределено;
    Для Каждого Задача Из Конвейер Цикл
        Значение = Вычислить( Задача );
        Если Значение <> Неопределено Тогда
			Прервать;
        КонецЕсли;
    КонецЦикла;

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Значение = НРег( СокрЛП( Значение ) );

	// Валидация значения
	ДопустимыеЗначения = Новый Массив;
	ДопустимыеЗначения.Добавить( SignatureTypeHttp() );
	ДопустимыеЗначения.Добавить( SignatureTypeCloudEvent() );
	Если ДопустимыеЗначения.Найти( Значение ) = Неопределено Тогда
		die( "ru = ""Некорректное значение signature-type: %1. Допустимые значения: http, cloudevent""", Значение );
	КонецЕсли;

    _FunctionSignatureType = Значение;

КонецПроцедуры



Процедура ЗапуститьВебСервер( Знач ПортСервера )

	Сервер = Новый ВебСервер( ПортСервера );

    Если _FunctionSignatureType = SignatureTypeHttp() Тогда
        Сервер.ДобавитьОбработчикЗапросов( ЭтотОбъект, "ОбработчикЗапросовHttp" );
    ИначеЕсли _FunctionSignatureType = SignatureTypeCloudEvent() Тогда
        Сервер.ДобавитьОбработчикЗапросов( ЭтотОбъект, "ОбработчикЗапросовCloudEvent" );
    Иначе
        die( "ru = ""Неподдерживаемый тип функции: """ + _FunctionSignatureType );
    КонецЕсли;

    Сервер.Запустить();

КонецПроцедуры



Процедура Инициализация()

	// кешируем Рефлектор
	_Рефлектор = Новый Рефлектор;

КонецПроцедуры



Процедура Запустить()
	
	// имя файла, в котором расположена функция
 	ФайлСценария = ОпределитьФайлСценария();
	
	// загрузим файл, содержащий функцию
	ЗагрузитьФайлСценария( ФайлСценария );

	// какую функцию выполнять
	ОпределитьВыполняемуюФункцию();

	// какой тип функции будет использоваться
	ОпределитьFunctionSignatureType();

	// на каком порту запускать сервер
	ПортСервера = ОпределитьПортСервера();

	// запустим сервер
	ЗапуститьВебСервер( ПортСервера );

КонецПроцедуры



Инициализация();

Попытка
	Запустить();
Исключение
	die("ru = ""Ошибка при старте фреймворка: %1""", ОписаниеОшибки() );
КонецПопытки;
