
// инициализация и чтение конфигурации
// - определить FunctionSource - имя файла, в котором искать выполняемую функцию
// - определить FunctionTarget - имя функции, которую необходимо запустить
// - определить Port - сетевой порт, на котором будет работать веб-сервер
// - определить FunctionSignatureType - тип события, обрабатываемый функцией
// поиск пользовательского файла и функции

#Область Переменные

// В этом объекте будет расположена пользовательская функция, запускаемая фреймворком
Перем _ОбъектСценария;

// Имя пользовательской функции, которая будет запущена фреймворком
Перем _ФункцияСценария;

// кеш для объекта Рефлектор
// Рефлектор часто используется при старте сервера и для запуска пользовательской функции, 
// поэтому имеет смысл его кешировать
Перем _Рефлектор;

#КонецОбласти

Процедура ОбработчикЗапросовHttp( Знач Контекст, Знач СледующийОбработчик ) Экспорт

	// запрос к robots.txt должен отдавать 404 согласно контакту
	Если "/robots.txt" = Контекст.Запрос.Путь Тогда
		Контекст.Ответ.КодСостояния = 404;
		Возврат;
	КонецЕсли;

	// запрос к favicon.ico должен отдавать 404 согласно контакту
	Если "/favicon.ico" = Контекст.Запрос.Путь Тогда
		Контекст.Ответ.КодСостояния = 404;
		Возврат;
	КонецЕсли;
	
	// вызываем пользовательскую функцию
	Параметры = Новый Массив;
	Параметры.Добавить( Контекст.Запрос );
	Параметры.Добавить( Контекст.Ответ );
	_Рефлектор.ВызватьМетод( _ОбъектСценария, _ФункцияСценария, Параметры );

КонецПроцедуры

Процедура ОбработчикЗапросовCloudEvent( Знач Контекст, Знач СледующийОбработчик ) Экспорт
	


КонецПроцедуры



ПеременныеСреды = ПеременныеСреды();
_Рефлектор = Новый Рефлектор();

FunctionSource = Неопределено;
Позиция = АргументыКоманднойСтроки.Найти("--source");
Если Позиция <> Неопределено Тогда
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		Сообщить("Не указано значение параметра командной строки --source", СтатусСообщения.Ошибка);
		ЗавершитьРаботу(1);
	КонецЕсли;
	FunctionSource = АргументыКоманднойСтроки[Позиция + 1];
КонецЕсли;
Если НЕ ЗначениеЗаполнено( FunctionSource ) Тогда

	Значение = ПеременныеСреды.Получить( "FUNCTION_SOURCE" );
	Если ЗначениеЗаполнено( Значение ) Тогда
		FunctionSource = Значение;
	КонецЕсли;

КонецЕсли;
Если НЕ ЗначениеЗаполнено( FunctionSource ) Тогда

	FunctionSource = "main.os";

КонецЕсли;

FunctionTarget = Неопределено;
Позиция = АргументыКоманднойСтроки.Найти("--target");
Если Позиция <> Неопределено Тогда
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		Сообщить("Не указано значение параметра командной строки --target", СтатусСообщения.Ошибка);
		ЗавершитьРаботу(1);
	КонецЕсли;
	FunctionTarget = АргументыКоманднойСтроки[Позиция + 1];
КонецЕсли;
Если НЕ ЗначениеЗаполнено( FunctionTarget ) Тогда

	Значение = ПеременныеСреды.Получить( "FUNCTION_TARGET" );
	Если ЗначениеЗаполнено( Значение ) Тогда
		FunctionTarget = Значение;
	КонецЕсли;

КонецЕсли;

ServerPort = Неопределено;
Позиция = АргументыКоманднойСтроки.Найти( "--port" );
Если Позиция <> Неопределено Тогда
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		Сообщить("Не указано значение параметра командной строки --port", СтатусСообщения.Ошибка);
		ЗавершитьРаботу(1);
	КонецЕсли;
	ServerPort = АргументыКоманднойСтроки[Позиция + 1];
КонецЕсли;
Если НЕ ЗначениеЗаполнено( ServerPort ) Тогда

	Значение = ПеременныеСреды.Получить( "PORT" );
	Если ЗначениеЗаполнено( Значение ) Тогда
		ServerPort = Значение;
	КонецЕсли;

КонецЕсли;
Если НЕ ЗначениеЗаполнено( ServerPort ) Тогда

	ServerPort = 8080;

КонецЕсли;

FunctionSignatureType = Неопределено;
Позиция = АргументыКоманднойСтроки.Найти("--signature-type");
Если Позиция <> Неопределено Тогда
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		Сообщить("Не указано значение параметра командной строки --signature-type", СтатусСообщения.Ошибка);
		ЗавершитьРаботу(1);
	КонецЕсли;
	FunctionSignatureType = АргументыКоманднойСтроки[Позиция + 1];
КонецЕсли;
Если НЕ ЗначениеЗаполнено( FunctionSignatureType ) Тогда

	Значение = ПеременныеСреды.Получить( "FUNCTION_SIGNATURE_TYPE" );
	Если ЗначениеЗаполнено( Значение ) Тогда
		FunctionSignatureType = Значение;
	КонецЕсли;

КонецЕсли;
Если НЕ ЗначениеЗаполнено( FunctionSignatureType ) Тогда

	FunctionSignatureType = "http";

КонецЕсли;



Файл = Новый Файл( FunctionSource );
Если НЕ Файл.Существует() Тогда
	Сообщить("Не найден файл с функцией", СтатусСообщения.ОченьВажное);
	ЗавершитьРаботу(1);
КонецЕсли;

Попытка
	ПодключитьСценарий( FunctionSource, "СценарийПользователяFunctionsFramework" );
Исключение
	Сообщить( "Не удалось загрузить сценарий с функцией", СтатусСообщения.ОченьВажное );
	ЗавершитьРаботу( 1 );
КонецПопытки;

Попытка
	_ОбъектСценария = Новый СценарийПользователяFunctionsFramework;
Исключение
	Сообщить( "Не удалось создать объект сценария с функцией", СтатусСообщения.ОченьВажное );
	ЗавершитьРаботу( 1 );
КонецПопытки;

ИспользуемаяФункция = Неопределено;
МетодыСценария = _Рефлектор.ПолучитьТаблицуМетодов( _ОбъектСценария );
Если ЗначениеЗаполнено( FunctionTarget ) Тогда
	Найденные = МетодыСценария.НайтиСтроки( Новый Структура( "Экспорт, Имя", Истина, FunctionTarget ) );
	Если Найденные.Количество() = 0 Тогда
		Сообщить( "Не найдена экспортная функция с именем " + FunctionTarget, СтатусСообщения.ОченьВажное );
		ЗавершитьРаботу(1);
	КонецЕсли;
	ИспользуемаяФункция = Найденные[0].Имя;
Иначе
	Аннотация = Неопределено;
	Если FunctionSignatureType = "http" Тогда
		Аннотация = "HttpFunction";
	ИначеЕсли FunctionSignatureType = "cloudevent" Тогда
		Аннотация = "CloudEventFunction";
	КонецЕсли;
	Найденные = Новый Массив;
	Для Каждого ОписаниеМетода Из МетодыСценария Цикл
		Если ОписаниеМетода.Экспорт И ОписаниеМетода.Аннотации.Найти( Аннотация, "Имя" ) <> Неопределено Тогда
			Найденные.Добавить( ОписаниеМетода.Имя );
		КонецЕсли;
	КонецЦикла;
	Если Найденные.Количество() = 0 Тогда
		Сообщить( "Не найдена функция для запуска в указанном сценарии", СтатусСообщения.ОченьВажное );
		ЗавершитьРаботу( 1 );
	КонецЕсли;
	Если Найденные.Количество() > 1 Тогда
		Сообщить( "Найдено несколько функций для запуска в указанном сценарии, невозможно определить какую из них запускать", СтатусСообщения.ОченьВажное );
		ЗавершитьРаботу( 1 );
	КонецЕсли;
	ИспользуемаяФункция = Найденные[0];
КонецЕсли;

_ФункцияСценария = ИспользуемаяФункция;

// запуск веб-сервера
Сервер = Новый ВебСервер();

Если FunctionSignatureType = "http" Тогда
	Сервер.ДобавитьОбработчикЗапросов( ЭтотОбъект, "ОбработчикЗапросовHttp" );
ИначеЕсли FunctionSignatureType = "cloudevent" Тогда
	Сервер.ДобавитьОбработчикЗапросов( ЭтотОбъект, "ОбработчикЗапросовCloudEvent" );
КонецЕсли;

Сервер.Запустить();
 