
#Область Переменные



// кеш объекта Рефлектор
// кешируем т.к. используется часто - при инициализации
// и при каждом запуске пользовательской функции
Перем _Рефлектор;

// объект, в котором расположена запускаемая функция
Перем _ОбъектСценария;
// имя запускаемой функции
Перем _ФункцияСценария;

// тип запускаемой функции
//
// Строка, возможные значения:
// - http
// - cloudevent
Перем _FunctionSignatureType;



#КонецОбласти



#Область ОбработчикиЗапросов



Процедура ОбработчикЗапросовHttp( Знач HTTPКонтекст, Знач СледующийОбработчик ) Экспорт

	// запросы к robots.txt / favicon.ico должны отдавать 404 согласно контракту
	Если ЭтоИгнорируемыйПуть( HTTPКонтекст.Запрос.Путь ) Тогда
		HTTPКонтекст.Ответ.КодСостояния = 404;
		Возврат;
	КонецЕсли;

	// вызываем пользовательскую функцию
	Параметры = Новый Массив;
	Параметры.Добавить( HTTPКонтекст.Запрос );
	Параметры.Добавить( HTTPКонтекст.Ответ );
	Попытка
		_Рефлектор.ВызватьМетод( _ОбъектСценария, _ФункцияСценария, Параметры );
	Исключение
		LogError( "Error during function execution: %1", ОписаниеОшибки() );
		HTTPКонтекст.Ответ.КодСостояния = 500;
	КонецПопытки;

КонецПроцедуры



Процедура ОбработчикЗапросовCloudEvent( Знач HTTPКонтекст, Знач СледующийОбработчик ) Экспорт

    // robots.txt / favicon.ico
    Если ЭтоИгнорируемыйПуть( HTTPКонтекст.Запрос.Путь ) Тогда
        HTTPКонтекст.Ответ.КодСостояния = 404;
        Возврат;
    КонецЕсли;

    // Парсинг CloudEvent
    Попытка
        Событие = ПрочитатьCloudEvent( HTTPКонтекст.Запрос );
    Исключение
		LogError( "Error parsing CloudEvent: %1", ОписаниеОшибки() );
        HTTPКонтекст.Ответ.КодСостояния = 400;
        Возврат;
    КонецПопытки;

	Если Событие = Неопределено Тогда
		LogError( "Unable to parse CloudEvent data from request, unknown event data format" );
		HTTPКонтекст.Ответ.КодСостояния = 400;
        Возврат;
	КонецЕсли;

    // Вызов пользовательской функции
    Параметры = Новый Массив;
    Параметры.Добавить( Событие );
    Попытка
        _Рефлектор.ВызватьМетод( _ОбъектСценария, _ФункцияСценария, Параметры );
    Исключение
		LogError( "Error during function execution: %1", ОписаниеОшибки() );
        HTTPКонтекст.Ответ.КодСостояния = 500;
        Возврат;
    КонецПопытки;

    // Успех (без тела)
    HTTPКонтекст.Ответ.КодСостояния = 204;

КонецПроцедуры



#КонецОбласти



#Область Вспомогательные


Процедура die( ТекстСообщения, Вставка1 = Неопределено, Вставка2 = Неопределено, Вставка3 = Неопределено, Вставка4 = Неопределено, Вставка5 = Неопределено )

	LogError( ТекстСообщения, Вставка1, Вставка2, Вставка3, Вставка4, Вставка5 );
	ЗавершитьРаботу( 1 );

КонецПроцедуры



Функция ФайлСуществует( Путь )

	Файл = Новый Файл( Путь );
	Возврат Файл.Существует();

КонецФункции


Функция ЕстьАннотация( Знач ОписаниеМетода, Знач Аннотация )

	Для Каждого ОписаниеАннотации Из ОписаниеМетода.Аннотации Цикл
		Если СтрокиРавны( ОписаниеАннотации.Имя, Аннотация ) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции



Функция ЕстьАннотацияHttp( Знач ОписаниеМетода )
	
	Возврат ЕстьАннотация( ОписаниеМетода, АннотацияHttp() );

КонецФункции



Функция ЕстьАннотацияCloudEvent( Знач ОписаниеМетода )

    Возврат ЕстьАннотация( ОписаниеМетода, АннотацияCloudEvent() );

КонецФункции



Функция ЭтоИгнорируемыйПуть( Знач Путь )

	// запросы к robots.txt / favicon.ico должны отдавать 404 согласно контракту
	Возврат СтрокиРавны( Путь, "/robots.txt" ) Или СтрокиРавны( Путь, "/favicon.ico" );

КонецФункции



Функция СтрокиРавны( Строка1, Строка2 )
	Возврат 0 = СтрСравнить( Строка1, Строка2 );
КонецФункции



Функция МетодСуществует( Знач Методы, ИмяМетода )

	Для Каждого ОписаниеМетода Из Методы Цикл
		Если СтрокиРавны( ОписаниеМетода.Имя, ИмяМетода ) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции



Процедура LogError( ТекстСообщения, Вставка1 = Неопределено, Вставка2 = Неопределено, Вставка3 = Неопределено, Вставка4 = Неопределено, Вставка5 = Неопределено )

	Сообщить( 
		СтрШаблон( ТекстСообщения, Вставка1, Вставка2, Вставка3, Вставка4, Вставка5 ),
		СтатусСообщения.ОченьВажное
	);

КонецПроцедуры

Процедура LogInfo( ТекстСообщения, Вставка1 = Неопределено, Вставка2 = Неопределено, Вставка3 = Неопределено, Вставка4 = Неопределено, Вставка5 = Неопределено )

	Сообщить( 
		СтрШаблон( ТекстСообщения, Вставка1, Вставка2, Вставка3, Вставка4, Вставка5 ),
		СтатусСообщения.Обычное
	);

КонецПроцедуры



Функция ЭтоКорректноеИмяМетода( ИмяМетода ) 

	// 1. Проверка на пустую строку
    Если ПустаяСтрока( ИмяМетода ) Тогда
        Возврат Ложь;
    КонецЕсли;

	// 2. Проверка на зарезервированные ключевые слова
	КлючевыеСлова = Новый Массив;
	// Русские операторы и конструкции
    КлючевыеСлова.Добавить( "если" );
    КлючевыеСлова.Добавить( "иначеесли" );
    КлючевыеСлова.Добавить( "иначе" );
    КлючевыеСлова.Добавить( "концесли" );
    КлючевыеСлова.Добавить( "для" );
    КлючевыеСлова.Добавить( "по" );
    КлючевыеСлова.Добавить( "цикл" );
    КлючевыеСлова.Добавить( "конеццикла" );
    КлючевыеСлова.Добавить( "пока" );
    КлючевыеСлова.Добавить( "продолжить" );
    КлючевыеСлова.Добавить( "прервать" );
    КлючевыеСлова.Добавить( "перейти" );
    КлючевыеСлова.Добавить( "процедура" );
    КлючевыеСлова.Добавить( "функция" );
    КлючевыеСлова.Добавить( "конецпроцедуры" );
    КлючевыеСлова.Добавить( "конецфункции" );
    КлючевыеСлова.Добавить( "перем" );
    КлючевыеСлова.Добавить( "возврат" );
    КлючевыеСлова.Добавить( "попытка" );
    КлючевыеСлова.Добавить( "исключение" );
    КлючевыеСлова.Добавить( "вызватьисключение" );
    КлючевыеСлова.Добавить( "конецпопытки" );
    КлючевыеСлова.Добавить( "новый" );
    КлючевыеСлова.Добавить( "выполнить" );
    КлючевыеСлова.Добавить( "ждать" );
    КлючевыеСлова.Добавить( "добавитьобработчик" );
    КлючевыеСлова.Добавить( "удалитьобработчик" );
    КлючевыеСлова.Добавить( "и" );
    КлючевыеСлова.Добавить( "или" );
    КлючевыеСлова.Добавить( "не" );
    КлючевыеСлова.Добавить( "асинх" );
    КлючевыеСлова.Добавить( "экспорт" );
    КлючевыеСлова.Добавить( "знач" );
    КлючевыеСлова.Добавить( "из" );
    КлючевыеСлова.Добавить( "истина" );
    КлючевыеСлова.Добавить( "ложь" );
    КлючевыеСлова.Добавить( "неопределено" );
    КлючевыеСлова.Добавить( "null" );  
    // Английские операторы и конструкции
    КлючевыеСлова.Добавить( "if" );
    КлючевыеСлова.Добавить( "elsif" );
    КлючевыеСлова.Добавить( "else" );
    КлючевыеСлова.Добавить( "endif" );
    КлючевыеСлова.Добавить( "for" );
    КлючевыеСлова.Добавить( "to" );
    КлючевыеСлова.Добавить( "do" );
    КлючевыеСлова.Добавить( "endo" );
    КлючевыеСлова.Добавить( "while" );
    КлючевыеСлова.Добавить( "continue" );
    КлючевыеСлова.Добавить( "break" );
    КлючевыеСлова.Добавить( "goto" );
    КлючевыеСлова.Добавить( "procedure" );
    КлючевыеСлова.Добавить( "function" );
    КлючевыеСлова.Добавить( "endprocedure" );
    КлючевыеСлова.Добавить( "endfunction" );
    КлючевыеСлова.Добавить( "var" );
    КлючевыеСлова.Добавить( "return" );
    КлючевыеСлова.Добавить( "try" );
    КлючевыеСлова.Добавить( "except" );
    КлючевыеСлова.Добавить( "raise" );
    КлючевыеСлова.Добавить( "endtry" );
    КлючевыеСлова.Добавить( "new" );
    КлючевыеСлова.Добавить( "execute" );
    КлючевыеСлова.Добавить( "await" );
    КлючевыеСлова.Добавить( "addhandler" );
    КлючевыеСлова.Добавить( "removehandler" );
    КлючевыеСлова.Добавить( "and" );
    КлючевыеСлова.Добавить( "or" );
    КлючевыеСлова.Добавить( "not" );
    КлючевыеСлова.Добавить( "async" );
    КлючевыеСлова.Добавить( "export" );
    КлючевыеСлова.Добавить( "val" );
    КлючевыеСлова.Добавить( "in" );
    КлючевыеСлова.Добавить( "each" );
    КлючевыеСлова.Добавить( "true" );
    КлючевыеСлова.Добавить( "false" );
    КлючевыеСлова.Добавить( "undefined" );
    
    Если КлючевыеСлова.Найти( НРег(ИмяМетода) ) <> Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    РегВыр = Новый РегулярноеВыражение( "^[a-zA-Zа-яА-ЯёЁ_][a-zA-Zа-яА-ЯёЁ0-9_]*$" );
    РегВыр.ИгнорироватьРегистр = Истина;
    
    Возврат РегВыр.Совпадает( ИмяМетода );

КонецФункции



Функция ПрочитатьCloudEventStructured( Знач Запрос )
	
	Заголовки = Запрос.Заголовки;
	ВсеЗаголовки = Заголовки.Получить( "Content-Type" );

	// нет заголовка Content-Type
	Если Не ЗначениеЗаполнено( ВсеЗаголовки ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// не указано ожидаемое значение заголовка для cloudevent
	Если Не СтрокиРавны( ВсеЗаголовки[0], "application/cloudevents+json" ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		CloudEvent = КакJson(Запрос.Тело);
	Исключение
		ВызватьИсключение "Error parsing request's body as json: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат CloudEvent;

КонецФункции



Функция ПрочитатьCloudEventBinary( Знач Запрос )

	ЗаголовкиЗапроса    = Запрос.Заголовки;
	ЗаголовкиCloudEvent = Новый Массив;
    
	// Binary mode - проверяем наличие заголовков Ce-
    Для Каждого КлЗн Из ЗаголовкиЗапроса Цикл
        Если СтрНачинаетсяС( КлЗн.Ключ, "Ce-" ) Тогда
            ЗаголовкиCloudEvent.Добавить( КлЗн );
        КонецЕсли;
    КонецЦикла;

	// нет ни одного заголовка CloudEvent
	// это не Binary запрос, прервемся
	Если Не ЗначениеЗаполнено( ЗаголовкиCloudEvent ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// заполняем объект CloudEvent из заголовков запроса
	CloudEvent = Новый Соответствие;
	Для Каждого КлЗн Из ЗаголовкиCloudEvent Цикл
		ИмяАтрибута = НРег( Сред( КлЗн.Ключ, 4 ) );
		CloudEvent.Вставить( ИмяАтрибута, КлЗн.Значение[0] );
	КонецЦикла;
	
	// нормализация объекта CloudEvent
	// CloudEventSDK требует если datacontenttype не был указан в запросе
	// его значение должно считаться равным "application/json"
	Если CloudEvent.Получить( "datacontenttype" ) = Неопределено Тогда
		CloudEvent.Вставить( "datacontenttype" , "application/json" );
	КонецЕсли;

	// читаем тело запроса в атрибут data
	Попытка
		ТелоОбъект = КакJson( Запрос.Тело );
	Исключение
		ВызватьИсключение "Error parsing request's body as json: " + ОписаниеОшибки();
	КонецПопытки;

	CloudEvent.Вставить( "data", ТелоОбъект );

	Возврат CloudEvent;

КонецФункции



Функция ПрочитатьCloudEventLegacy( Знач Запрос )

	// TODO не реализовано полностью
	// нужно реализовать конвертацию старого legacy формата в формат CloudEvent

	Заголовки = Запрос.Заголовки;
	ЗаголовкиContentType = Заголовки.Получить( "Content-Type" );
	// если заголовок Content-Type есть, но содержит что-то кроме application/json - это не cloud event
	// заголовка иногда может не быть, это нормально, не ошибка 
	Если ЗначениеЗаполнено( ЗаголовкиContentType ) И Не СтрокиРавны( ЗаголовкиContentType[0], "application/json" ) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// пробуем распарсить тело запроса как json
	Попытка
		EventRequest = КакJson(Запрос.Тело);
	Исключение
		// распарсить не удалось - считаем что это не legacy event
		Возврат Неопределено;
	КонецПопытки;
	
	Data    = EventRequest.Получить( "data" );
	Context = EventRequest.Получить( "context" );
	// если поля context нет в запросе - попробуем формат
	// когда контекст - это все поля кроме data на верхнем уровне json
	Если Context = Неопределено Тогда
		Context = Новый Соответствие;
		Для Каждого КлЗн Из EventRequest Цикл
			Если КлЗн.Ключ <> "data" Тогда
				Context.Вставить( КлЗн.Ключ, КлЗн.Значение );
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// все проверки пройдены, 
	// создаем объект CloudEvent
	CloudEvent = Новый Соответствие;
    CloudEvent.Вставить( "specversion", "1.0" );
    CloudEvent.Вставить( "type",   Context[ "eventType" ] );
    CloudEvent.Вставить( "source", Context[ "resource" ] );
    CloudEvent.Вставить( "id",     Context[ "eventId" ] );
    CloudEvent.Вставить( "time",   Context[ "timestamp" ] );
    CloudEvent.Вставить( "data",   Data );

	Возврат CloudEvent;

КонецФункции



Функция ПрочитатьCloudEvent( Знач Запрос )

	Конвейер = Новый Массив;
	Конвейер.Добавить( "ПрочитатьCloudEventStructured( Запрос )" );
	Конвейер.Добавить( "ПрочитатьCloudEventBinary( Запрос )" );
	Конвейер.Добавить( "ПрочитатьCloudEventLegacy( Запрос )" );

	Для Каждого Задача Из Конвейер Цикл
		Значение = Вычислить( Задача );
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЦикла;

    Возврат Неопределено;

КонецФункции



Функция КакJson( Данные )

	// в oscript 2.0.1 не реализован метод ОткрытьПоток() у объекта ЧтениеJSON
	// поэтому преобразование json в тела запроса (которое поток) получается такое вот длинное:
	// Поток -> ДвоичныеДанные -> Строка ->  Соответствие
	ЧтениеДанных = Новый ЧтениеДанных(Данные);
	ТелоСтрока = ПолучитьСтрокуИзДвоичныхДанных( ЧтениеДанных.Прочитать().ПолучитьДвоичныеДанные() );
	ЧтениеДанных.Закрыть();

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку( ТелоСтрока );
	ОбъектJSON = ПрочитатьJSON( ЧтениеJSON, Истина );
	ЧтениеJSON.Закрыть();

	Возврат ОбъектJSON;

КонецФункции



#КонецОбласти



#Область ЧтениеКонфигурации



// Общий разбор параметра конфигурации: сперва пробуем взять значение
// из ключа командной строки, если ключа нет - берем переменную окружения.
// Если ключ командной строки указан, но без значения (или с пустым значением) -
// это ошибка конфигурации, прерываем работу
Функция ЗначениеИзКоманднойСтрокиИлиСреды( Знач ИмяКлюча, Знач ИмяПеременнойСреды )

	Позиция = АргументыКоманднойСтроки.Найти( ИмяКлюча );

	Если Позиция = Неопределено Тогда
		Возврат ПеременныеСреды().Получить( ИмяПеременнойСреды );
	КонецЕсли;

	// если ключ командной строки указан последним - значения нет
	Если Позиция = АргументыКоманднойСтроки.ВГраница() Тогда
		die( "The value of the command line parameter %1 is not specified", ИмяКлюча );
	КонецЕсли;

	// берем следующий за искомым параметр командной строки
	Значение = АргументыКоманднойСтроки[ Позиция + 1 ];

	Если ПустаяСтрока( Значение ) Тогда
		die( "The value of the command line parameter %1 is empty", ИмяКлюча );
	КонецЕсли;

	Возврат Значение;

КонецФункции



Функция КонфигурацияFunctionTarget()
	Возврат ЗначениеИзКоманднойСтрокиИлиСреды( "--target", "FUNCTION_TARGET" );
КонецФункции



Функция КонфигурацияFunctionSource()
	Возврат ЗначениеИзКоманднойСтрокиИлиСреды( "--source", "FUNCTION_SOURCE" );
КонецФункции



Функция КонфигурацияFunctionSignatureType()
	Возврат ЗначениеИзКоманднойСтрокиИлиСреды( "--signature-type", "FUNCTION_SIGNATURE_TYPE" );
КонецФункции



#КонецОбласти



#Область Константы



Функция АннотацияHttp()
	Возврат "HttpFunction";
КонецФункции



Функция АннотацияCloudEvent()
	Возврат "CloudEventFunction";
КонецФункции



Функция SignatureTypeHttp()
	Возврат "http";
КонецФункции



Функция SignatureTypeCloudEvent()
	Возврат "cloudevent";
КонецФункции



Функция ПортСервераПоУмолчанию()	
	Возврат 8080;
КонецФункции



Функция FunctionSourceПоУмолчанию()
	Возврат "main.os";
КонецФункции



Функция SignatureTypeПоУмолчанию()
    Возврат SignatureTypeHttp();
КонецФункции



#КонецОбласти



Функция ОпределитьФайлСценария()

	Конвейер = Новый Массив;
	Конвейер.Добавить( "КонфигурацияFunctionSource()" );
	Конвейер.Добавить( "FunctionSourceПоУмолчанию()" );

	Файл = Неопределено;
	Для Каждого Задача Из Конвейер Цикл
		Файл = Вычислить( Задача );
		Если Файл <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если Файл = Неопределено Тогда
		die( "Failed to determine the name of the file containing the function to execute" );
	КонецЕсли;

	Если Не ФайлСуществует( Файл ) Тогда
		die( "File not found: %1", Файл );
	КонецЕсли;

	Возврат Файл;
	
КонецФункции



Процедура ЗагрузитьФайлСценария( Знач ИмяСценария )

	// загружаем файл с функцией
	Попытка
		_ОбъектСценария = ЗагрузитьСценарий( ИмяСценария );
	Исключение
		die( "Error loading script file: %1", ОписаниеОшибки() );
	КонецПопытки;

КонецПроцедуры



Функция ОпределитьВыполняемуюФункциюПоАннотации( Знач МетодыСценария )
	
	// высший приоритет имеют функции, помеченные специальной аннотацией
	АннотированныеМетоды = Новый Массив;
	Для Каждого ОписаниеМетода Из МетодыСценария Цикл
		ЕстьАннотацияHttp       = ЕстьАннотацияHttp( ОписаниеМетода );
		ЕстьАннотацияCloudEvent = ЕстьАннотацияCloudEvent( ОписаниеМетода );

		// проверим что функция не имеет сразу несколько разных аннотаций
		// если так - это ошибка конфигурации, прервем работы скрипта
		Если ЕстьАннотацияHttp И ЕстьАннотацияCloudEvent Тогда
			die( "The function has multiple different annotations, which is not allowed" );
		КонецЕсли;

		Если ЕстьАннотацияHttp Или ЕстьАннотацияCloudEvent Тогда
			АннотированныеМетоды.Добавить( ОписаниеМетода );
		КонецЕсли;
	КонецЦикла;

	// функций с аннотацией не найдено, прервемся
	Если АннотированныеМетоды.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// нашлось несколько аннотированных функций, 
	// не можем определить какую из них выполнять
	// это ошибка конфигурации, завершим работу приложения
	Если АннотированныеМетоды.Количество() > 1 Тогда
		die( "Multiple functions found to run, it is unclear which one to execute" );
	КонецЕсли;

	// дальше аннотированная функция ровно одна

	// по аннотации можно сразу определить тип выполняемой функции
	Если ЕстьАннотацияHttp( АннотированныеМетоды[0] ) Тогда
		_FunctionSignatureType = SignatureTypeHttp();
	КонецЕсли;
	Если ЕстьАннотацияCloudEvent( АннотированныеМетоды[0] ) Тогда
		_FunctionSignatureType = SignatureTypeCloudEvent();
	КонецЕсли;

	_ФункцияСценария = АннотированныеМетоды[0].Имя;
	Возврат Истина;

КонецФункции



Функция ОпределитьВыполняемуюФункциюПоКонфигурации( Знач МетодыСценария )

	
	конфиг = КонфигурацияFunctionTarget();

	Если конфиг = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	конфиг = СокрЛП( конфиг );

	Если Не ЗначениеЗаполнено( конфиг ) Тогда
		die( "Empty function name specified in configuration" );
	КонецЕсли;
	
	// проверим что переданноя в конфигурации имя корректно
	Если НЕ ЭтоКорректноеИмяМетода( конфиг ) Тогда
		die( "The function name specified in configuration is not a valid function identifier" );
	КонецЕсли;

	// проверим что указанный в конфигурации метод существует у сценария
	// если метода нет - это ошибка конфигурации, завершим работу
	Если Не МетодСуществует( МетодыСценария, конфиг ) Тогда
		die( "Function with name %1 specified in configuration not found in script file", конфиг );
	КонецЕсли;

	_ФункцияСценария = конфиг;
	Возврат Истина;

КонецФункции



Функция ОпределитьВыполняемуюФункциюПоУмолчанию( Знач МетодыСценария )
	
	ИмяФункцииПоУмолчанию = "main";
	Если Не МетодСуществует( МетодыСценария, ИмяФункцииПоУмолчанию ) Тогда
		Возврат Ложь;
	КонецЕсли;

	_ФункцияСценария = ИмяФункцииПоУмолчанию;
	Возврат Истина;

КонецФункции



Процедура ОпределитьВыполняемуюФункцию()

	// искать будем только среди экспортных методов
	ЭкспортныеМетодыСценария = 
		_Рефлектор.ПолучитьТаблицуМетодов( _ОбъектСценария )
		.НайтиСтроки( Новый Структура( "Экспорт", Истина ) );

	Конвейер = Новый Массив;
	// 1. ПОИСК СРЕДИ АННОТИРОВАННЫХ ФУНКЦИЙ
	Конвейер.Добавить( "ОпределитьВыполняемуюФункциюПоАннотации( ЭкспортныеМетодыСценария )" );
	// 2. ПОИСК ФУНКЦИЙ, УКАЗАННЫХ В КОНФИГУРАЦИИ
	Конвейер.Добавить( "ОпределитьВыполняемуюФункциюПоКонфигурации( ЭкспортныеМетодыСценария )" );
	// 3. ПОИСК ФУНКЦИИ ПО-УМОЛЧАНИЮ 
	Конвейер.Добавить( "ОпределитьВыполняемуюФункциюПоУмолчанию( ЭкспортныеМетодыСценария )" );

	ПараметрыЗадачи = Новый Массив;
	ПараметрыЗадачи.Добавить( ЭкспортныеМетодыСценария );
	Для Каждого Задача Из Конвейер Цикл
		Успешно = Вычислить( Задача );
		Если ТипЗнч( Успешно ) = Тип( "Булево" ) И Успешно Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;

	// если дошли сюда - функцию определить не удалось
	die( "Failed to determine the name of the function to execute" );

КонецПроцедуры



Функция ОпределитьПортСервера()

	Конвейер = Новый Массив;
	Конвейер.Добавить( "ПортСервераПоКонфигурации()" );
	Конвейер.Добавить( "ПортСервераПоУмолчанию()" );

	Для Каждого Задача Из Конвейер Цикл
		Порт = Вычислить( Задача );
		Если Порт <> Неопределено Тогда
			Возврат Порт;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции



Функция ПортСервераПоКонфигурации()

	Порт = ЗначениеИзКоманднойСтрокиИлиСреды( "--port", "PORT" );

	Если Порт = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	// валидация значения

	Порт = СокрЛП( Порт );

    РегВыр = Новый РегулярноеВыражение( "^[0-9]+$" );
    Если Не РегВыр.Совпадает( Порт ) Тогда
		die( "Specified value %1 is not a valid port number", Порт );
	КонецЕсли;

	// преобразуем в число
	Попытка
		Порт = Число( Порт );
	Исключение
		die( "Failed to convert port value %1 to number", Порт );
	КонецПопытки;

	// проверим на корректность диапазона портов
	Если Порт < 0 Или Порт > 65535 Тогда
		die( "Value %1 is not a valid network port number", Порт );
	КонецЕсли;

	Возврат Порт;

КонецФункции



Процедура ОпределитьFunctionSignatureType()

	// тип функции мог быть определен ранее аннотацией
	// в этом случае  дальнейшие шаги делать не нужно
	Если _FunctionSignatureType <> Неопределено Тогда
		Возврат;
	КонецЕсли;

    Конвейер = Новый Массив;
    Конвейер.Добавить( "КонфигурацияFunctionSignatureType()" );
    Конвейер.Добавить( "SignatureTypeПоУмолчанию()" );

	Значение = Неопределено;
    Для Каждого Задача Из Конвейер Цикл
        Значение = Вычислить( Задача );
        Если Значение <> Неопределено Тогда
			Прервать;
        КонецЕсли;
    КонецЦикла;

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Значение = НРег( СокрЛП( Значение ) );

	// Валидация значения
	ДопустимыеЗначения = Новый Массив;
	ДопустимыеЗначения.Добавить( SignatureTypeHttp() );
	ДопустимыеЗначения.Добавить( SignatureTypeCloudEvent() );
	Если ДопустимыеЗначения.Найти( Значение ) = Неопределено Тогда
		die( "Invalid signature-type value: %1. Valid values: http, cloudevent", Значение );
	КонецЕсли;

    _FunctionSignatureType = Значение;

КонецПроцедуры



Процедура ЗапуститьВебСервер( Знач ПортСервера )

	Сервер = Новый ВебСервер( ПортСервера );

    Если _FunctionSignatureType = SignatureTypeHttp() Тогда
        Сервер.ДобавитьОбработчикЗапросов( ЭтотОбъект, "ОбработчикЗапросовHttp" );
    ИначеЕсли _FunctionSignatureType = SignatureTypeCloudEvent() Тогда
        Сервер.ДобавитьОбработчикЗапросов( ЭтотОбъект, "ОбработчикЗапросовCloudEvent" );
    Иначе
        die( "Unsupported function type: %1", _FunctionSignatureType );
    КонецЕсли;

	Сообщение = "Starting functions framework server, port: %1, function name: %2, function signature type: %3";
	LogInfo( Сообщение, ПортСервера, _ФункцияСценария, _FunctionSignatureType );

    Сервер.Запустить();

КонецПроцедуры



Процедура Инициализация()

	// кешируем Рефлектор
	_Рефлектор = Новый Рефлектор;

КонецПроцедуры



Процедура Запустить()
	
	// имя файла, в котором расположена функция
 	ФайлСценария = ОпределитьФайлСценария();
	
	// загрузим файл, содержащий функцию
	ЗагрузитьФайлСценария( ФайлСценария );

	// какую функцию выполнять
	ОпределитьВыполняемуюФункцию();

	// какой тип функции будет использоваться
	ОпределитьFunctionSignatureType();

	// на каком порту запускать сервер
	ПортСервера = ОпределитьПортСервера();

	// запустим сервер
	ЗапуститьВебСервер( ПортСервера );

КонецПроцедуры



Инициализация();

Попытка
	Запустить();
Исключение
	die( "Error starting the framework: %1", ОписаниеОшибки() );
КонецПопытки;
